data/perf/campaign-f3deebfbab60/primary/memcached/tsan/run4/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       153302.80          ---          ---         5.05134         4.99100        11.39100        14.27100     10462.87 
Gets      1533011.16      1231.01   1531780.15         4.93450         4.86300        11.19900        14.07900     38830.24 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1686313.97      1231.01   1531780.15         4.94512         4.86300        11.19900        14.14300     49293.11 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       142870.37          ---          ---         5.27196         5.34300        11.58300        14.52700      9750.86 
Gets      1428687.95      1147.24   1427540.71         5.14756         5.18300        11.39100        14.33500     36187.80 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1571558.31      1147.24   1427540.71         5.15887         5.18300        11.39100        14.33500     45938.66 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       147650.03          ---          ---         5.18186         5.18300        11.51900        14.46300     10077.07 
Gets      1476484.09      1079.12   1475404.96         5.06051         5.05500        11.32700        14.27100     37392.01 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1624134.12      1079.12   1475404.96         5.07155         5.05500        11.32700        14.33500     47469.08